{
  "<PAD>": 0,
  "<SOS>": 1,
  "<EOS>": 2,
  "<UNK>": 3,
  "\\Epsilon": 4,
  "\\Upsilon": 5,
  "\\epsilon": 6,
  "\\right\\}": 7,
  "\\upsilon": 8,
  "\\Lambda": 9,
  "\\approx": 10,
  "\\daleth": 11,
  "\\lambda": 12,
  "\\left\\{": 13,
  "\\right)": 14,
  "\\right]": 15,
  "\\right|": 16,
  "\\Alpha": 17,
  "\\Delta": 18,
  "\\Gamma": 19,
  "\\Kappa": 20,
  "\\Omega": 21,
  "\\Sigma": 22,
  "\\Theta": 23,
  "\\aleph": 24,
  "\\alpha": 25,
  "\\delta": 26,
  "\\gamma": 27,
  "\\gimel": 28,
  "\\kappa": 29,
  "\\left(": 30,
  "\\left[": 31,
  "\\left|": 32,
  "\\omega": 33,
  "\\sigma": 34,
  "\\theta": 35,
  "\\times": 36,
  "\\Beta": 37,
  "\\Iota": 38,
  "\\Zeta": 39,
  "\\beta": 40,
  "\\beth": 41,
  "\\cdot": 42,
  "\\frac": 43,
  "\\iota": 44,
  "\\sqrt": 45,
  "\\zeta": 46,
  "\\Chi": 47,
  "\\Eta": 48,
  "\\Phi": 49,
  "\\Psi": 50,
  "\\Rho": 51,
  "\\Tau": 52,
  "\\chi": 53,
  "\\cos": 54,
  "\\eta": 55,
  "\\exp": 56,
  "\\int": 57,
  "\\lim": 58,
  "\\log": 59,
  "\\neq": 60,
  "\\phi": 61,
  "\\psi": 62,
  "\\rho": 63,
  "\\sin": 64,
  "\\sum": 65,
  "\\tan": 66,
  "\\tau": 67,
  "\\Mu": 68,
  "\\Nu": 69,
  "\\Pi": 70,
  "\\Xi": 71,
  "\\ge": 72,
  "\\le": 73,
  "\\ln": 74,
  "\\mu": 75,
  "\\nu": 76,
  "\\pi": 77,
  "\\xi": 78,
  "^{": 79,
  "_{": 80,
  " ": 81,
  "!": 82,
  "$": 83,
  "(": 84,
  ")": 85,
  "*": 86,
  "+": 87,
  ",": 88,
  "-": 89,
  ".": 90,
  "/": 91,
  "0": 92,
  "1": 93,
  "2": 94,
  "3": 95,
  "4": 96,
  "5": 97,
  "6": 98,
  "7": 99,
  "8": 100,
  "9": 101,
  ":": 102,
  "<": 103,
  "=": 104,
  ">": 105,
  "A": 106,
  "B": 107,
  "C": 108,
  "D": 109,
  "E": 110,
  "F": 111,
  "G": 112,
  "H": 113,
  "I": 114,
  "J": 115,
  "K": 116,
  "L": 117,
  "M": 118,
  "N": 119,
  "O": 120,
  "P": 121,
  "Q": 122,
  "R": 123,
  "S": 124,
  "T": 125,
  "U": 126,
  "V": 127,
  "W": 128,
  "X": 129,
  "Y": 130,
  "Z": 131,
  "[": 132,
  "\\": 133,
  "]": 134,
  "^": 135,
  "_": 136,
  "a": 137,
  "b": 138,
  "c": 139,
  "d": 140,
  "e": 141,
  "f": 142,
  "g": 143,
  "h": 144,
  "i": 145,
  "j": 146,
  "k": 147,
  "l": 148,
  "m": 149,
  "n": 150,
  "o": 151,
  "p": 152,
  "q": 153,
  "r": 154,
  "s": 155,
  "t": 156,
  "u": 157,
  "v": 158,
  "w": 159,
  "x": 160,
  "y": 161,
  "z": 162,
  "{": 163,
  "|": 164,
  "}": 165
}